# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.


lst = [12, 1, 2]
print(type(lst))

set = {"декабрь", "январь", "февраль"}
print(type(set))

frozenset = {"a", "b", "c"}
print(type(frozenset))

new_dict = {"12":"декабрь","1":"январь", "2":"февраль"}
print(type(new_dict))

tuple = (1, 2, 3)
print(type(tuple))

bool = [0, 1]
print(type(bool))

int = 5
print(type(int))

str = "abrakadabra"
print(type(str))




